<?php

?>
<div class="container-fluid">
<div class="article">
<h2>Изменение в расписании работы конференции</h2>
<p>Доклад на тему "Влияние активности солнца на рост растений", состоится в аудитории 121 в 14:00.</p>
</div>

<div class="article">
<h2>Объявление</h2>
<p>
Желающие посетить местный краеведческий музей могут записаться у секретаря.
</p>
</div>

<div class="article">
<h2>Объявление</h2>
<p>
Доклад о чистоте рек отменчется. О времени проведения доклада сообщим дополнительно.
</p>

</div>

</div>