<?php

?>
<div class="container-fluid">
<div class="article">
<h2>Что такое PHP?</h2>
<p>PHP – это широко используемый язык сценариев общего назначения с открытым исходным кодом. Говоря проще, PHP это язык программирования, специально разработанный для написания web-приложений (сценариев), исполняющихся на Web-сервере. Аббревиатура PHP означает “Hypertext Preprocessor (Препроцессор Гипертекста)".</p>
<p>В настоящее время поддерживается подавляющим большинством хостинг-провайдеров и является одним из лидеров среди языков, применяющихся для создания динамических веб-сайтов.</p>
</div>

<div class="article">
<h2>Для чего нужна CSS?</h2>
<p>
CSS используется для определения стилей ваших документов, в том числе дизайна, верстки и вариаций макета для различных устройств и размеров экрана. Вы можете разместить стили CSS внутри тега "HEAD" документа с встроенной таблицей стилей, или приложить отдельный CSS-файл, который будет определять ваши стили извне.
</p>
</div>

<div class="article">
<h2>JavaScript это...</h2>
<p>
JavaScript ("JS" для краткости) — это полноценный динамический язык программирования, который применяется к HTML документу, и может обеспечить динамическую интерактивность на веб-сайтах. Его разработал Brendan Eich, сооснователь проекта Mozilla, Mozilla Foundation и Mozilla Corporation.
</p>

</div>

<div class="article">
<h2>Практическое задание</h2>
<p>
Задание для практики: — создать таблицу в которую можно записывать вес пользователя (visitor) или лоличество пройденных за день шагов или давление крови или что-нибудь полезное. Вывести эту полезную информацию в виде таблицы (как сделано для статистики), отсортировать по датам в убывающем порядке. Дописать фильтр для выборки по датам (текущий месяц, прошлый месяц, вчера, за прошлую неделю и т.д.). Файл с таким фильтром (date_filter.php) выложен в корне сайта (использовался для подобных целейю, наверное нужно оптимизировать). Кроме этого неплохо-бы подправить шероховатости и ошибки приложения.
</p>
</div>
</div>